#Область ПрограммныйИнтерфейс

// Добавляет поле контактного лица в форму документа.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - дорабатываемая форма.
//
Процедура ДобавитьПолеКонтактноеЛицо(Форма) Экспорт
    // Начало. ТЮР. Добавление контактного лица.
    Если Форма.Элементы.Найти("ТЮР_КонтактноеЛицо") <> Неопределено Тогда
        Возврат;
    КонецЕсли;

    ЭлементОриентир = Форма.Элементы.Найти("Договор");
    Если ЭлементОриентир = Неопределено Тогда
        ЭлементОриентир = Форма.Элементы.Найти("Контрагент");
    КонецЕсли;

    Если ЭлементОриентир = Неопределено Тогда
        Возврат;
    КонецЕсли;

    Родитель = ЭлементОриентир.Родитель;
    СледующийЭлемент = Неопределено;
    ИндексОриентира = Родитель.ПодчиненныеЭлементы.Индекс(ЭлементОриентир);

    Если Родитель.ПодчиненныеЭлементы.Количество() > ИндексОриентира + 1 Тогда
        СледующийЭлемент = Родитель.ПодчиненныеЭлементы.Получить(
            ИндексОриентира + 1);
    КонецЕсли;

    НовоеПоле = Форма.Элементы.Вставить(
        "ТЮР_КонтактноеЛицо", Тип("ПолеФормы"), Родитель, СледующийЭлемент);

    НовоеПоле.Вид = ВидПоляФормы.ПолеВвода;
    НовоеПоле.ПутьКДанным = "Объект.ТЮР_КонтактноеЛицо";
    НовоеПоле.Заголовок = "Контактное лицо";

    // Конец. ТЮР. Добавление контактного лица.
КонецПроцедуры

#КонецОбласти